{
  "ai-schedule-use-guide": {
    "title": "小爱课程表使用指南 for HAUTer​~",
    "summary": "文章介绍了作者为河南工业大学学生开发并维护的“小爱课程表”课表适配功能，通过小米手机自带的小爱课程表或第三方应用实现课表自动导入与提醒，支持课程冲突检测与手动调整，并提供详细的使用教程和开发过程分享。文中强调了原生功能的便捷性与颜值，同时呼吁用户优先使用学校官方小程序或手机自带功能，避免冗余广告，也分享了开发中的成就感与技术细节。"
  },
  "vscode-plugin-recommended-2025": {
    "title": "2025 前端开发 vscode 常用插件推荐",
    "summary": "本文总结了作者2024年以来常用的VSCode前端开发插件与工具，重点推荐了新增的实用插件，如Shader语言支持、Tailwind类名高亮、shadcn颜色预览、React国际化处理、Rainbow CSV等，强调了提升开发效率和代码可读性的功能。同时整理了核心开发、辅助及实用工具类插件，并根据使用频率和实际需求优化了推荐列表，部分旧工具或因编辑器切换（如转向Cursor）而被弃用。"
  },
  "hexo-vercel-deploy-blog": {
    "title": "Hexo + vercel部署博客",
    "summary": "本文介绍了作者使用 Hexo 搭配 Shoka 主题，并通过 Vercel 部署博客的全过程，强调了 Vercel 在部署效率、国内访问速度、域名自定义和版本管理等方面的优点，替代了之前的 GitHub Pages 方案，并提供了详细的配置与使用说明。"
  },
  "hexo-migration-xlog-notes": {
    "title": "Hexo 迁移 xLog 有感",
    "summary": "作者分享了将个人博客从 Hexo 迁移到 xLog 的经历，介绍了 xLog 作为一个基于区块链的现代化博客系统，具备开源、去中心化、安全、界面美观等特点，支持 Markdown、IPFS 图片存储、AI 生成摘要、一键部署等功能，且技术栈与作者常用工具高度契合。同时，文章也指出了当前 xLog 在批量操作、搜索、分类、编辑器体验等方面的不足，并强调了 Web3 不仅是投机领域，更蕴含着对数据主权和去中心化互联网的深刻探索与理想。"
  },
  "hexo-url-optimization": {
    "title": "Hexo博客url优化",
    "summary": "这篇文章介绍了如何通过自定义URL来优化Hexo博客的文章链接，避免因中文文件名导致的URL转义冗长问题。作者推荐在文章中手动设置具有语义的链接后缀，并通过配置文件和模板默认值实现便捷操作，使URL更直观、友好且有利于SEO。"
  },
  "backblaze-cloudflare-picgo-imgbed": {
    "title": "Backblaze + Cloudflare + Picgo 打造免费顺畅的图床体验",
    "summary": "文章介绍了作者基于Backblaze B2云存储和Cloudflare CDN搭建免费图床的方案，通过Picgo+s3插件实现图片上传，利用Backblaze低成本、高稳定性和Cloudflare免费CDN及域名解析功能，实现高性能、安全的图片存储与访问。同时，文章详细分享了配置过程中的坑点与解决方案，如DNS切换、URL重写规则配置、Picgo插件参数设置等，适合希望搭建低成本、自托管图床的用户参考。"
  },
  "follow-travel": {
    "title": "15 个邀请码后，聊聊我对 Follow 的深度体验感受",
    "summary": "文章作者分享了自己对 Follow 这款 RSS 阅读工具的深度使用体验，重点介绍了其多视图设计（如图片、视频、社交、文章等）和列表功能的亮点，强调了交互流畅、功能丰富、内容发现便捷等特点。同时指出了当前存在的问题，如订阅源数量上限、移动端体验不佳、功能仍处早期迭代阶段，以及用户容易沉迷的缺点。"
  },
  "vscode-plugin-recommended-2022": {
    "title": "2022 前端开发 vscode 常用插件及其他工具推荐",
    "summary": "本文总结了2022年前端开发中常用的VSCode插件及工具，涵盖开发、辅助、实用和外观优化等多个类别，推荐了如GitLens、Prettier、Tailwind CSS IntelliSense、Live Server等核心插件，并附带浏览器工具、截图录屏软件等实用推荐，帮助开发者提升编码效率与开发体验。"
  },
  "implementation-of-datepicker": {
    "title": "仿Antd组件之DatePicker组件实现（简易）",
    "summary": "这篇文章介绍了作者基于 React 封装的 Ant Design DatePicker 日期选择框组件，实现了日、月、年三个面板的交互功能，支持日期选择、面板切换与动画效果，并通过 ref 判断点击事件来源实现外部关闭功能。组件支持默认日期设置与日期变化回调，具备良好的交互体验和可扩展性，虽存在封装不足和 bug，但体现了自定义组件开发的乐趣与学习价值。"
  },
  "campus-sns-develop": {
    "title": "Campus SNS 校园社区后端接口开发（附前端地址）",
    "summary": "文章介绍了作者基于Koa2和Sequelize搭建的校园社区后端项目，具备完善的接口功能和清晰的目录结构，涵盖文章、用户、评论、分区等核心功能，支持权限控制、软删除、统计分析及WebSocket在线用户监测。项目文档齐全、代码注释详尽，虽存在分支管理缺失和技术栈较旧的问题，但作为新人学习后端开发的实践案例，具有良好的参考价值和教学意义。"
  },
  "lost-my-cat-story": {
    "title": "寻猫记：记一次难忘的找猫经历",
    "summary": "文章讲述了一位姐姐在家中猫咪“腊八”意外走失后的焦急寻找过程，通过贴寻猫启事、使用强光手电和热成像仪、邻里互助等手段最终在邻居窗台找到猫咪的感人经历，并总结了找猫的实用经验与重要教训。"
  },
  "fe-talk-1": {
    "title": "浅谈前端的变与不变",
    "summary": "文章探讨了前端技术的“变”与“不变”：表面技术不断迭代，如框架、工具和CSS标准更新，但底层设计思想如状态管理、组件分解和性能优化始终不变。前端的本质是表达方式的演进，其真正价值在于承载创意与美，不仅是功能实现，更是个体对想法的精心呈现与表达。"
  },
  "2024-life-review": {
    "title": "2024，心有所热，步履不停",
    "summary": "这篇文章是作者对2024年生活的深情回顾，涵盖了生活、工作、情感、消费与兴趣等多个方面。他以“现充”自居，分享了这一年中购置的新设备、热爱的美食、旅行见闻、游戏体验、追番心得以及对自我成长的感悟，整体风格温暖、真诚，传递出对生活的热爱与积极态度。"
  },
  "2023-life-review": {
    "title": "2023，稀松平常的一年",
    "summary": "这篇文章是作者2023年年终总结，以轻松幽默的口吻回顾了全年生活与工作：从北漂实习到毕业，经历了租房、生活日常、美食探索与兴趣爱好，如做流麻、追番、玩游戏等。虽技术上有所懈怠，但通过维护TG频道、记录生活与兴趣，完成了个人成长与生活记录，整体呈现为平静而充实的一年。"
  },
  "2022-life-review": {
    "title": "2022，写给自己的一篇文章",
    "summary": "这篇文章是作者在2022年春招结束后写的一篇自我回顾，记录了大学四年的学习、生活与成长经历。从编程热爱到技术实践，从社团活动到生活点滴，展现了她作为女生在计算机专业中的坚持与探索，也反思了过往的盲目努力与成长中的真实与遗憾。"
  },
  "2020暑假训练总结：ysx": {
    "title": "2020暑假训练总结：ysx",
    "summary": "这个暑假，作者通过自学8个算法专题（如线段树、最短路、网络流等）提升了算法能力，尤其在前三个专题和博弈论上掌握较扎实，但后几个专题仅停留在模板层面。尽管刷题和参赛中遇到大量WA、TLE和低级错误，也意识到自身能力不足，未来将通过回刷和努力提升，争取在新学期的蓝桥杯和CCF中取得更好成绩。"
  },
  "my-claude-code-record": {
    "title": "我的 Claude Code 使用小记",
    "summary": "文章分享了作者使用 Claude Code 的日常体验与实用技巧，强调其在代码开发中的高效性与便捷性。通过自定义斜杠命令、权限设置、语音通知等功能，提升了开发效率，并通过项目学习、代码审查等场景展示了其在代码理解、项目分析和团队协作中的强大能力。"
  },
  "my-claude-code-record-2": {
    "title": "我的 Claude Code 使用小记 2",
    "summary": "本文作者分享了自己近4个月高强度使用Claude Code的实战体验与思考，强调其在复杂项目开发中的高效辅助作用，尤其在前端音视频APP开发中显著提升开发效率。文章详细介绍了Claude Code的Plan Mode、技能（Skills）系统、工作流设计及与Cursor、Codex等工具的对比，同时提出AI编程应有明确边界，建议在技术债务严重或逻辑混乱的项目中谨慎使用，并推荐了多个实用的AI辅助开发实践和文章资源。"
  },
  "163-yanxuan-review-2022-spring-frontend": {
    "title": "2022春暑期实习网易严选前端一二HR面凉经",
    "summary": "文章讲述了作者在网易严选实习面试的全过程，包括两轮技术面试和一轮HR面试。技术面试重点考察了React中的Virtual DOM与Diff算法、Koa中间件模型、事件委托等，以及Node.js与Java框架（如SpringBoot）的对比和数据库操作经验；HR面试中谈及项目经历、团队协作与个人成长，最终因入职前未充分准备，未能通过面试。"
  },
  "shoplazza-review-2022-spring-frontend": {
    "title": "2022春暑期实习店匠前端一二面面经",
    "summary": "文章整理了一次小厂前端面试的常见问题，涵盖JavaScript基础（闭包、作用域、节流防抖、事件监听）、CSS布局、浏览器缓存、前端框架（Vue/React）、算法（排序）及面试技巧，内容偏向基础考察，强调实际应用和理解深度。面试者分享了技术栈偏好和学习路径，体现对前端技术的综合理解和实践经验。"
  },
  "bytedance-review-2022-spring-frontend": {
    "title": "字节前端暑期实习一面凉经",
    "summary": "文章是一份字节跳动前端一面的面试面经，主要总结了面试中涉及的网络原理（如URL解析、DNS查找、TCP三次握手、HTTP/HTTPS流程）、前端核心概念（DOM/CSSOM树构建、JS加载时机、跨域CORS、安全问题如XSS/CSRF）、CSS选择器优先级与居中问题，以及JS原型链、数据类型判断和二叉树层序遍历等知识点，整体体现了一名前端开发者对基础理论的掌握情况，但也暴露了在细节深度和系统性理解上的不足，强调了需要加强知识的深入学习和实践。"
  },
  "metaapp-review-2022-spring-frontend": {
    "title": "MetaApp一二面面经（已OC）",
    "summary": "文章讲述了作者在 MetaApp 公司进行前端技术面试的全过程，从一面到二面，内容涵盖 JavaScript 基础（原型链、异步、变量提升、虚拟 DOM）、CSS、HTTP/HTTPS、网络协议、算法题（排序、顺子判断）以及项目经验（跨域、文件上传、服务端协作），最终获得中台全栈 Web 实习机会。面试官态度友好，考察全面，反映出对候选人技术深度和实际问题解决能力的重视。"
  },
  "meituan-examination-2022-spring-frontend": {
    "title": "2022春美团笔试暑期实习笔试题复盘",
    "summary": "文章总结了作者在美团笔试中遇到的五道题目及其解题思路和结果：幸运数、乘积为正、做饭、炸弹、黑白树涂色。其中前两题和最后一题AC率高，分别为签到题和树结构遍历问题，第三题为状压DP的典型应用，第四题为贪心策略但未完全通过，整体反映了笔试中不同难度题目的考察点。"
  },
  "163-leihuo-examination-2022-spring-frontend": {
    "title": "2022春网易雷火前端暑期实习笔试(AK)",
    "summary": "笔试包含7道不定项选择题、5道填空题、2道问答题和3道编程题，总分较高，编程题难度较低且代码量少，完成时间短。考生在编程题中快速完成斐波那契、括号匹配等题目，但最长递增子序列题做错，整体表现稳定，最终通过Copilot辅助完成问答题。"
  },
  "160-yanxuan-examination-2022-spring-frontend": {
    "title": "2022春网易互联网前端暑期实习笔试",
    "summary": "文章讲述了作者在前端笔试中的面试经历，包含一道设计模式问答题和四道编程题。编程题涵盖打怪、求字符串最大分数、构造完全二叉树和走出地图的最短时间，其中打怪和走出地图的题目通过DFS或贪心/动态规划解决，部分题目考察了算法优化与边界处理能力。"
  },
  "jd-examination-2022-spring-frontend": {
    "title": "2022春京东前端笔试题目复盘",
    "summary": "文章回顾了京东前端开发笔试的题目内容，包含30道选择题（涵盖数据库、高数等知识，后半部分偏向前端）和两道编程题。编程题一求区间内除以P的余数最大值，思路是判断区间是否跨越完整P的倍数，最大余数为P-1或边界值；编程题二为优化分鸡蛋操作，通过不断除以3或加1使数变小，但存在边界问题导致部分样例错误。"
  },
  "360-examination-2022-spring-frontend": {
    "title": "2022春360笔试题目复盘-研发E卷",
    "summary": "文章整理了360研发E卷前端笔试题，包含30道选择题（涵盖数据库、高数等偏题）和两道编程题。编程题1为强密码验证，用正则或遍历实现；编程题2为堆积货物问题，通过枚举因数和剪枝求解最坏情况下的被盗体积。"
  },
  "tailwind-update-v4-migrate": {
    "title": "Tailwind CSS v4.0 升级与 Astro 5.2 项目迁移记录",
    "summary": "Tailwind CSS 4.0 推出高性能构建引擎，构建速度提升5倍以上，支持级联层、容器查询、3D变换等现代CSS特性，提供零配置安装和Vite深度集成。新增动态实用程序、CSS主题变量、字段自适应、inert与nth变体等丰富功能，同时提供自动化迁移工具，解决Astro等项目中的插件兼容性问题，推荐通过升级至Astro 5.2+并手动配置Vite插件实现平滑迁移。"
  },
  "dynamic-particle-system-tech-analysis": {
    "title": "从像素到粒子：p5.js 图像转动态粒子的设计与实现",
    "summary": "本文介绍了如何将静态图像转换为动态粒子系统，通过物理模拟实现图像的粒子化表现，核心思路是将图像像素映射为粒子，利用粒子的运动规律（如寻径、噪声扰动、鼠标交互）实现平滑过渡和自然视觉效果。文章详细讲解了图像解构、粒子映射、物理模拟、对象池优化、随机采样与坐标转换等关键技术，并基于p5.js实现，后续迁移到React中通过@p5-wrapper/react进行组件化集成，支持TypeScript类型安全和响应式更新，适用于展示类场景如品牌Logo动态呈现。"
  },
  "tailwind-update-v3-3": {
    "title": "Tailwind CSS v3.3 为我们带来了哪些惊喜？",
    "summary": "Tailwind CSS v3.3 推出了多项实用新特性，包括深色模式扩展调色板、渐变颜色精确控制、开箱即用的多行文本截断、字体大小与行高联合设置、CSS 变量简写语法、列表项图片标记、断字控制及表格标题对齐等功能，显著提升了开发效率和灵活性。开发者可通过 npm 安装或 Tailwind Play 在线体验这些新功能。"
  },
  "react-native-note-1": {
    "title": "RN 学习小记之使用 Expo 创建项目",
    "summary": "本文记录了作者从零开始搭建 React Native 项目的过程，重点介绍了使用 Expo 搭建跨平台移动端应用的流程。通过详细说明 Windows 环境下安卓开发环境的配置（如安装 Android Studio、配置 SDK 13 及 ANDROID_HOME 环境变量），以及 Expo 的优势和推荐库（如 Safe Area、Reanimated、SecureStore 等），帮助有前端基础的开发者快速上手并高效开发 React Native 应用。"
  },
  "floating-ui-experience-popover": {
    "title": "Floating UI 使用经验分享 - Popover",
    "summary": "本文介绍了如何在 React 中使用 Floating UI 库创建 Popover（弹出框）组件，重点讲解了 `useFloating` 核心 Hook 的配置、常用中间件（如自动定位、偏移、箭头等）以及交互功能（点击打开/关闭、Esc 关闭、屏幕阅读器支持等）。文章强调 Floating UI 专注于锚点定位，不提供样式或复杂交互，适合需要高度自定义的开发者，建议结合官方文档深入学习。"
  },
  "floating-ui-experience-dialog": {
    "title": "Floating UI 使用经验分享 - Dialog",
    "summary": "本文分享了如何使用 @floating-ui/react 库创建一个功能完整的可访问对话框（Dialog）组件，重点介绍了其模态特性、背景遮罩、焦点管理及无障碍支持。通过 useFloating、useClick、useDismiss、useRole 等 Hook 实现交互逻辑，并结合 FloatingPortal、FloatingOverlay 和 FloatingFocusManager 构建可受控、可自定义的对话框，支持 ESC 键、外部点击关闭、屏幕阅读器访问和焦点管理。"
  },
  "软件工程期末小测": {
    "title": "软件工程期末小测",
    "summary": "文章系统讲解了软件工程中的核心概念与过程模型，包括瀑布模型、增量模型、原型模型和敏捷开发（如XP和Scrum）的原理与实践，强调了需求明确性、迭代开发、团队协作、风险控制和良好编码原则的重要性，并纠正了教材中关于需求工程七个步骤的错误描述。"
  },
  "计算机组成原理复习总结（四）指令系统": {
    "title": "计算机组成原理复习总结（四）指令系统",
    "summary": "文章系统介绍了计算机指令系统的概念、发展过程、性能要求及具体结构。重点阐述了指令格式中的操作码与地址码设计、各类寻址方式（如立即、直接、间接、寄存器、偏移、段、堆栈等）及其特点和应用场景。"
  },
  "计算机组成原理复习总结（六）总线系统": {
    "title": "计算机组成原理复习总结（六）总线系统",
    "summary": "本文介绍了计算机系统中的总线概念、分类及连接方式。总线是连接计算机各功能部件的公共信息通道，分为内部总线、系统总线和I/O总线，具有物理、功能、电气和时间等特性，并通过标准化实现设备互换。文章重点说明了单总线和多总线两种结构，其中多总线结构通过分离高速、中速和低速设备连接，提升系统效率和性能。"
  },
  "计算机组成原理复习总结（五）中央处理器": {
    "title": "计算机组成原理复习总结（五）中央处理器",
    "summary": "本文系统介绍了中央处理器（CPU）的组成、功能及工作原理，重点阐述了CPU的基本结构（运算器、控制器）和主要寄存器（如PC、IR、AR、AC、PSW等），详细说明了指令周期的执行过程，包括取指、分析和执行阶段，并对比了同步、异步和联合控制方式。文章进一步深入讲解了微程序控制器的工作原理，包括微命令、微操作、微指令与微程序的关系，以及微指令编码（直接、编码、混合表示法）和微地址形成方式（计数器方式与多路转移方式），并对比了水平型与垂直型微指令的特点。最后，简要提及了流水CPU与并行处理技术。"
  },
  "计算机组成原理复习总结（二）运算方法和运算器": {
    "title": "计算机组成原理复习总结（二）运算方法和运算器",
    "summary": "本文系统介绍了计算机中数的表示与运算方法，包括数制转换、真值与机器数、BCD码、字符编码、校验码、定点数的表示与运算（原码、反码、补码、移码）以及浮点数的表示与运算（重点讲解补码加减法、移位、乘除运算及溢出判别）。重点阐述了补码在实现减法转加法、移位运算和溢出检测中的作用，并介绍了浮点数的IEEE 754标准及加减运算流程，如对阶、尾数运算、规格化等。"
  },
  "计算机组成原理复习总结（三）多层次的存储器": {
    "title": "计算机组成原理复习总结（三）多层次的存储器",
    "summary": "本文系统介绍了计算机系统中的多层次存储器体系结构，重点讲解了存储器的分类、层次结构及各类存储器的工作原理。内容涵盖SRAM和DRAM的结构与差异、只读存储器（ROM）及闪存（FLASH）的特点、双端口与多模块交叉存储器的并行技术，以及缓存（Cache）的原理、命中机制与平均访问时间。通过程序访问的局部性原理，Cache有效缓解了CPU与主存之间的速度不匹配问题，提升了系统整体性能。"
  },
  "计算机组成原理复习总结（七）外围设备": {
    "title": "计算机组成原理复习总结（七）外围设备",
    "summary": "本文系统介绍了计算机外围设备的基本概念、分类及主要类型，重点讲解了磁盘存储设备的组成原理、技术指标（如存储密度、存取时间、数据传输率）及计算实例，并阐述了显示设备的关键参数，包括分辨率、灰度级、刷新机制和显存容量。内容强调了外围设备在数据输入输出、信息传递和人机交互中的核心作用，以及其在性能、结构和功能上的持续优化与技术发展。"
  },
  "计算机组成原理复习总结（一）计算机系统概论": {
    "title": "计算机组成原理复习总结（一）计算机系统概论",
    "summary": "文章系统介绍了计算机的基本概念与发展历程，包括计算机的分类、性能指标、发展规律（如摩尔定律）以及冯·诺依曼体系结构和计算机系统的层次结构。重点阐述了计算机的性能参数（如主频、吞吐量、MIPS、MFLOPS等）和层次化结构，从硬件到软件逐层展开，说明了不同层级在程序设计和使用中的作用与特点。"
  },
  "compile-learning-experiment_4": {
    "title": "编译原理 实验四 LR(1)分析法程序",
    "summary": "本文实现了一个LR(1)分析程序，用于对给定文法的符号串进行语法分析，支持从左向右、自底向上的分析过程，并能判断输入符号串是否为合法句子，输出详细分析过程和错误提示；实验通过构造LR(1)分析表（包括action表和goto表）和设计相应的数据结构与函数流程，实现了对表达式（含+、-、*、括号、i和#）的语法分析。"
  },
  "compile-learning-experiment_2": {
    "title": "编译原理 实验二 LL(1)分析法程序",
    "summary": "本文实验旨在通过LL(1)分析法实现对算术表达式的语法分析，包括构建LL(1)分析表、编写词法分析程序，并设计驱动程序对输入符号串进行预测分析。实验以给定文法为基准，对输入表达式（如i*(i+i)+(i*i)#）进行分析，输出每一步的产生式选择或终结符匹配过程，若表达式合法则输出“分析成功”，否则提示具体错误信息。"
  },
  "compile-learning-experiment_1": {
    "title": "编译原理 实验一 词法分析器设计",
    "summary": "该实验旨在通过构建有限自动机（DFA）实现对源程序中单词的词法分析，能够识别基本保留字、标识符、常数、运算符和分隔符五大类单词，并输出其种别码和符号值。实验通过设计DFA状态转换图和相应的函数模块，实现了对输入源程序的逐字符扫描与词法识别，支持错误跳过和格式化输出，最终验证了词法分析程序的正确性与可扩展性。"
  },
  "操作系统编程实验——创建进程": {
    "title": "操作系统编程实验——创建进程",
    "summary": "该实验通过使用系统调用fork()创建父进程和两个子进程，演示了进程创建与并发执行的过程。每个进程根据自身PID输出不同字符（父进程输出'a'，子进程输出'b'和'c'），验证了多进程并发运行的特性，且进程间互不干扰，结果具有不可再现性。"
  },
  "操作系统实验——动态分区分配方式的模拟": {
    "title": "操作系统实验——动态分区分配方式的模拟",
    "summary": "本文通过C语言实现了一个基于首次适应算法的动态分区分配程序，模拟操作系统中内存的分配与回收过程，利用空闲分区链管理内存块，并在每次操作后输出空闲分区链的状态。实验基于给定的作业请求序列，展示了内存如何根据首次适应策略进行分配和回收，加深了对动态分区存储管理机制的理解。"
  },
  "secure-basics-4": {
    "title": "信息安全概论复习四 Chapte8、9、10",
    "summary": "文章系统总结了无线局域网安全、网络安全技术及信息隐藏技术的核心内容。重点介绍了WLAN的安全机制，包括WEP的局限性及中国标准WAPI（基于ECC公钥和对称加密）的改进方案；详细阐述了网络扫描、防火墙（包过滤、应用代理、状态监测）、入侵检测系统（IDS）和蜜罐技术的基本原理与应用；最后介绍了信息隐藏与数字水印技术的工作原理及实际应用。"
  },
  "secure-basics-3": {
    "title": "信息安全概论复习三 Chapter5、6、7",
    "summary": "文章系统介绍了公钥密码技术、密钥管理及安全协议的核心内容。重点讲解了RSA和Diffie-Hellman算法的原理与应用，阐述了公钥基础设施（PKI）如何通过数字证书实现公钥与身份的绑定与管理，并介绍了网络各层中的典型安全协议如IPSec、TLS、PPP-CHAP等，强调了安全协议在实体认证、密钥协商和数据保护中的关键作用。"
  },
  "secure-basics-2": {
    "title": "信息安全概论复习二 Chapter4 对称密码技术",
    "summary": "本文介绍了对称密码算法的基本原理与典型代表，包括古典密码（如凯撒密码、维尼吉亚密码）、分组密码（如DES和AES）及流密码（如RC4），重点讲解了各类算法的加解密机制、工作原理与安全性特点，并介绍了分组密码的常用工作模式（ECB、CBC、CFB、OFB、CTR）。通过对比分析，阐明了现代对称加密算法在安全性、效率和实际应用中的优势与设计思路。"
  },
  "secure-basics-1": {
    "title": "信息安全概论复习一（Chapter1、2、3）",
    "summary": "本文系统介绍了信息安全的基本概念、保障体系及核心密码技术。内容涵盖信息安全的六大属性（保密性、完整性、鉴别性、不可否认性、可用性、可控性），信息安全事件的七类分类及分级方法，以及信息安全保障体系的“风险评估—策略制定—保护—监测—响应—恢复”六步模型和等级保护制度。同时，详细讲解了对称与非对称密码体制的基本原理、分类及应用，重点包括分组密码和流密码的结构设计思想，以及公钥密码中陷门单向函数的数学基础。"
  },
  "链式前向星存图、二分图匹配之匈牙利算法 模板&分析（存用）": {
    "title": "链式前向星存图、二分图匹配之匈牙利算法 模板&分析（存用）",
    "summary": "文章主要讲解了链式前向星这种高效图存储结构，以及二分图匹配的核心算法——匈牙金算法。通过具体例题（如Fire Net和The Accommodation of Students）说明了如何将问题建模为二分图并使用匈牙利算法求解最大匹配。"
  },
  "模板类封装(2)——顺序栈和链式栈": {
    "title": "模板类封装(2)——顺序栈和链式栈",
    "summary": "文章介绍了使用C++实现链式栈和顺序栈的基本操作，包括入栈、出栈、取栈顶、判断栈空栈满、获取元素个数、展示元素等功能，并通过模板类进行封装，支持通用元素类型。同时实现了循环队列的入队、出队、取队首等基本操作，涵盖初始化、销毁、判断空满、元素展示与清空等核心功能。"
  },
  "模板类封装(1)——单链表": {
    "title": "模板类封装(1)——单链表",
    "summary": "文章介绍了如何实现一个支持多种操作的单链表类，包括按序号或值查找、插入、删除、获取长度、展示链表以及逆转链表等功能，并强调了在实现过程中对边界情况（如空链表、单节点、非法位置）的特判和 bug 修复。代码使用 C++11 的 nullptr 特性，并采用头结点设计，所有操作从 head->next 开始。"
  },
  "数据结构学习笔记＜9＞ 散列查找": {
    "title": "数据结构学习笔记＜9＞ 散列查找",
    "summary": "文章介绍了散列表（哈希表）的基本概念、工作原理及应用。通过散列函数将关键词映射到存储地址，实现平均查找时间接近常量O(1)的高效查找，但需处理冲突并控制装填因子在0.5到0.85之间以保证性能。文中详细对比了开放定址法（如线性、平方、双散列探测）和链地址法的冲突处理策略，并分析了不同方法在不同装填因子下的查找效率，强调散列法是以空间换时间的高效查找结构，适用于关键词比较成本高或需快速定位的场景。"
  },
  "数据结构学习笔记＜8＞ 排序": {
    "title": "数据结构学习笔记＜8＞ 排序",
    "summary": "文章系统介绍了拓扑排序与简单排序两大主题。首先讲解了AOV网络中的拓扑排序概念与实现方法，重点分析了关键路径问题在AOE网络中的求解过程；随后详细对比了多种排序算法，包括冒泡、插入、选择、堆、归并、快速排序及基数排序，从时间复杂度、稳定性、空间消耗和适用场景等方面进行了全面比较，最后总结了不同排序算法在实际问题中的应用价值。"
  },
  "数据结构学习笔记＜7＞ 图": {
    "title": "数据结构学习笔记＜7＞ 图",
    "summary": "文章系统介绍了图的基本概念、表示方法（邻接矩阵与邻接表）、图的遍历（DFS与BFS）、图的连通性与路径问题，重点讲解了无权图和有权图的单源最短路径算法（BFS与Dijkstra），以及最小生成树的构建方法（Kruskal与Prim算法）。内容从理论到实践，结合伪代码说明了图的建模、遍历、最短路径和生成树的求解过程。"
  },
  "数据结构学习笔记＜6＞ 堆与哈夫曼树与并查集": {
    "title": "数据结构学习笔记＜6＞ 堆与哈夫曼树与并查集",
    "summary": "文章介绍了堆和哈夫曼树的基本概念与操作，以及并查集的简要说明。堆是一种基于完全二叉树的数组结构，支持插入、删除和建堆操作，其中最大堆可通过线性时间复杂度构建；哈夫曼树是带权路径长度最小的二叉树，通过最小堆实现节点合并，用于构造最优前缀编码，广泛应用于数据压缩；文章末尾简要提及并查集作为集合操作的工具。"
  },
  "数据结构学习笔记＜5＞ 二叉搜索树与平衡二叉树": {
    "title": "数据结构学习笔记＜5＞ 二叉搜索树与平衡二叉树",
    "summary": "文章介绍了二叉搜索树（BST）的基本概念、核心操作（查找、插入、删除）以及平衡二叉树（AVL树）的结构与调整机制。通过分析插入序列生成的BST，说明如何判断不同序列是否生成同一棵二叉搜索树，核心方法是构建一棵树并按顺序验证各序列在树中的搜索路径是否一致。"
  },
  "数据结构学习笔记＜4＞ 二叉树": {
    "title": "数据结构学习笔记＜4＞ 二叉树",
    "summary": "文章系统介绍了树和二叉树的基本概念、术语、性质及存储结构。重点阐述了树的定义、结点关系、层次与深度等基本特性，并详细说明了二叉树的五种形态、遍历方法（先序、中序、后序、层序）以及顺序和链式存储结构。同时介绍了二叉树的重要性质和查找操作的基本方法。"
  },
  "数据结构学习笔记＜3＞ 队列": {
    "title": "数据结构学习笔记＜3＞ 队列",
    "summary": "文章介绍了队列的抽象数据类型及其顺序和链式存储实现。顺序存储通过循环队列优化空间利用率，实现高效入队和出队操作；链式存储则通过单链表在表尾进行入队、表头进行出队，避免了固定空间限制。"
  },
  "数据结构学习笔记＜2＞ 堆栈": {
    "title": "数据结构学习笔记＜2＞ 堆栈",
    "summary": "本文介绍了堆栈的抽象数据类型及其顺序和链式存储实现，详细说明了入栈和出栈操作，并以中缀表达式转为后缀表达式为例，展示了堆栈在表达式求值中的应用，同时还提及了函数调用、递归、深度优先搜索和回溯算法等典型应用场景。"
  },
  "数据结构学习笔记＜1＞ 线性表": {
    "title": "数据结构学习笔记＜1＞ 线性表",
    "summary": "文章介绍了线性表的抽象数据类型及其顺序存储和链式存储两种实现方式。顺序表通过数组存储元素，支持高效随机访问，但插入和删除需移动元素；链式表通过链表结构连接节点，插入和删除操作只需修改指针，无需移动数据，灵活性更高。文章通过具体操作和代码演示，对比了两种存储结构在查找、插入、删除和求表长等基本操作上的实现与特点。"
  },
  "归并排序循环实现（存用）": {
    "title": "归并排序循环实现（存用）",
    "summary": "本文介绍了非递归归并排序算法，相比递归版本，它在空间和时间上更高效，额外空间复杂度最低为 O(N)，并提供了清晰的代码注释说明实现过程。"
  },
  "广义表、多重链表初接触": {
    "title": "广义表、多重链表初接触",
    "summary": "文章介绍了广义表作为线性表的推广，允许元素为单元素或另一个广义表，并阐述了多重链表的概念及其在存储复杂数据结构中的应用。以稀疏矩阵为例，通过十字链表只存储非零元素，利用行指针和列指针实现高效存储，避免了传统二维数组空间浪费的问题。"
  },
  "图论——解决最小生成树问题(Kruskal算法&Prim算法)": {
    "title": "图论——解决最小生成树问题(Kruskal算法&Prim算法)",
    "summary": "文章介绍了最小生成树问题的两种经典算法：Kruskal算法和Prim算法。Kruskal算法通过按边权排序并使用并查集判断环来构造最小生成树，效率高且易于实现；Prim算法从一个节点出发，逐步扩展生成树，类似Dijkstra算法。文章结合多个经典题目（如HDU1863、1879、1875和洛谷P3366）说明了这两种算法的应用场景和解题思路。"
  },
  "PTA数据结构题目集 第四周——二叉搜索树&二叉平衡树": {
    "title": "PTA数据结构题目集 第四周——二叉搜索树&二叉平衡树",
    "summary": "文章介绍了PAT（程序设计能力测试）中关于二叉搜索树和AVL树的几道经典题目，涵盖判断两序列是否生成同一棵二叉搜索树、求AVL树根节点、生成完全二叉搜索树的层次遍历序列，以及实现二叉搜索树的基本操作集。重点讲解了通过中序遍历性质和完全二叉树的结构特性来推导层次遍历序列的方法。"
  },
  "PTA数据结构题目集 第十周——排序（下）": {
    "title": "PTA数据结构题目集 第十周——排序（下）",
    "summary": "文章主要介绍了三道排序相关的编程题：统计工龄题考察基础排序效率，PAT Judge题要求根据提交分数生成排名并处理相同分数时的降序和ID顺序规则，Sort with Swap(0,i)题通过分析数字排列中的环结构，计算仅用与0交换实现排序的最小交换次数。"
  },
  "PTA数据结构题目集 第十一周——散列查找": {
    "title": "PTA数据结构题目集 第十一周——散列查找",
    "summary": "文章主要介绍了关于散列查找的几道经典题目，包括电话聊天狂人、Hashing、QQ账户申请与登陆、Hashing硬版本等，涵盖了散列插入、冲突解决、拓扑排序等核心思想，并强调了实际应用中可能遇到的边界情况和优化方法。同时，也介绍了KMP算法在字符串匹配中的应用。"
  },
  "PTA数据结构题目集 第六周——图（上）": {
    "title": "PTA数据结构题目集 第六周——图（上）",
    "summary": "文章整理了图论相关的一系列题目，涵盖连通集的DFS和BFS求解、社交网络中“六度空间”理论的应用，以及经典场景如拯救007的图遍历问题，旨在帮助学习者掌握图的遍历与连通性分析。"
  },
  "PTA数据结构题目集 第八周——图（下）": {
    "title": "PTA数据结构题目集 第八周——图（下）",
    "summary": "该文章整理了图论相关题目，涵盖最小生成树、拓扑排序及关键活动的求解。其中“公路村村通”是典型的最小生成树问题，可用Kruskal算法解决；“How Long Does It Take”和“关键活动”分别基于拓扑排序求最早完成时间与关键活动，后者需计算最晚完成时间与机动时间，编程复杂度较高，易在测试点出错。"
  },
  "PTA数据结构题目集 第五周——堆&哈夫曼树&并查集": {
    "title": "PTA数据结构题目集 第五周——堆&哈夫曼树&并查集",
    "summary": "文章整理了三道与数据结构相关的题目：第一题是关于最小堆的路径查询，要求输出每个节点到根节点路径上的值；第二题是使用并查集解决计算机网络连通性问题，支持查询和连接操作，并判断最终是否全部连通；第三题是判断给定的编码是否为哈夫曼编码的最优解，需构建哈夫曼树计算最小权路径长度（WPL），并验证编码是否为前缀码。"
  },
  "PTA数据结构题目集 第二周——线性结构": {
    "title": "PTA数据结构题目集 第二周——线性结构",
    "summary": "文章整理了PAT（程序设计能力测试）线性结构模块中的四道经典题目，涵盖链表操作与栈的应用。题目包括两个有序链表的合并、一元多项式的乘法与加法、链表分段反转以及栈的弹出序列判断，均考察链表和栈的基本操作与逻辑思维，适合C语言初学者和算法训练者练习。"
  },
  "PTA数据结构题目集 第九周——排序（上）": {
    "title": "PTA数据结构题目集 第九周——排序（上）",
    "summary": "这篇文章整理了关于排序算法的几道经典题目，包括判断序列是通过插入排序还是归并排序得到的，以及插入排序与堆排序的区分。重点介绍了插入排序和归并排序的实现方法，强调了使用循环版本归并排序的必要性，并提供了相关代码和思路参考。"
  },
  "PTA数据结构题目集 第三周——栽树（二叉树等）": {
    "title": "PTA数据结构题目集 第三周——栽树（二叉树等）",
    "summary": "文章介绍了三道关于二叉树的PAT题目，涵盖树的同构判断、叶子节点的输出以及根据先序和中序遍历序列推导后序遍历序列。每道题均通过递归或层次遍历等方法解决，强调了建树、遍历和逻辑推理能力的训练。"
  },
  "PTA数据结构题目集 第七周——图（中）": {
    "title": "PTA数据结构题目集 第七周——图（中）",
    "summary": "文章介绍了三道图论相关题目，涵盖Floyd算法和Dijkstra算法的变形应用：第一题通过Floyd求最短路，找出使最大魔咒长度最小的动物组合；第二题用Floyd求最短跳转路径，并优先选择第一跳转更优的路径；第三题是Dijkstra的变形，求两点间最小距离及花费，若路径相同则选花费更少的。"
  },
  "PTA数据结构题目集 第一周——最大子列和算法、二分查找": {
    "title": "PTA数据结构题目集 第一周——最大子列和算法、二分查找",
    "summary": "本文档是关于“复杂度”主题的题目集合，包含三个实验题：最大子列和问题（基础要求）、最大子序列和问题（考研真题，难度较高）、二分查找（函数填空题）。每个题目均涉及算法设计与实现，重点考察动态规划、分治思想及边界处理，其中部分测试点容易出错，需特别注意。"
  },
  "MOOC浙大数据结构课后题记录——PTA数据结构题目集(全)": {
    "title": "MOOC浙大数据结构课后题记录——PTA数据结构题目集(全)",
    "summary": "本文是作者在学习浙大数据结构课程过程中，针对MOOC平台PTA题集的详细记录与总结，涵盖了线性结构、二叉树、图、排序、散列查找等核心数据结构知识点，并附有各周题目的代码实现与思路解析。文章通过分周整理，系统梳理了从最大子列和到图的最短路、最小生成树、排序算法及散列查找等经典问题，体现了数据结构学习的完整过程与实践总结。"
  },
  "高级java小测2——线程": {
    "title": "高级java小测2——线程",
    "summary": "该文章设计并实现了火车票售票系统的放票与购票功能，通过多线程模拟服务器（Producer）每30分钟随机放出10张票，客户（Customer）每3分钟随机购买一张票。系统使用共享的Tickets类管理余票和时间，确保放票与购票过程的同步与并发安全。"
  },
  "高级java复习笔记（期末不要挂啦）": {
    "title": "高级java复习笔记（期末不要挂啦）",
    "summary": "文章系统总结了Java中常用的设计模式、核心编程概念及实际应用，重点涵盖了工厂模式、装饰器模式、观察者模式、代理模式和策略模式的设计思想与应用场景，强调了通过设计模式提升代码可维护性与可扩展性。同时介绍了Java对象实例化方式、反射、序列化、监听器机制、AOP切面编程、Socket网络通信、多线程同步与线程池、数据库连接池等关键技术，以及Comparable和Comparator比较接口的使用，为理解Java面向对象编程和实际开发提供了全面的理论与实践基础。"
  },
  "高级java作业(反射、Collection、正则、工厂设计模式和观察者模式)": {
    "title": "高级java作业(反射、Collection、正则、工厂设计模式和观察者模式)",
    "summary": "文章通过实例讲解了Java反射机制的使用，展示了如何通过Class对象动态获取类的字段、方法、构造方法并创建对象；同时介绍了Collection接口的基本操作、迭代器的遍历方式以及比较器在集合排序中的应用；对比了JavaScript、Python和Java在正则表达式使用上的异同；最后简要介绍了工厂模式和观察者模式的设计思想及实现思路。"
  },
  "python网络爬虫学习笔记(一) 爬取简单静态网页": {
    "title": "python网络爬虫学习笔记(一) 爬取简单静态网页",
    "summary": "文章系统介绍了使用 urllib3 和 requests 库实现 HTTP 请求、设置请求头、超时和重试机制，并通过正则表达式、XPath 和浏览器开发者工具解析网页内容，最后将数据以 JSON 格式存储。重点对比了正则与 XPath 在网页解析中的应用，并结合实际案例演示了从网络请求到数据提取的完整流程。"
  },
  "nest-learn-project-1": {
    "title": "NestJS学习之优秀项目分析与最佳实践",
    "summary": "本文深入剖析了 NestJS 框架的核心架构与设计思想，通过分析优秀项目的目录结构和模块化实践，系统讲解了模块（Module）、服务（Service）、控制器（Controller）、DTO、实体（Entity）、守卫（Guard）、拦截器（Interceptor）和反射器（Reflector）等关键概念与应用场景。文章结合代码示例，展示了如何通过分层架构实现关注点分离，利用 DTO 进行数据验证与转换，通过守卫和拦截器实现权限控制与响应处理，并强调了元数据在自定义功能中的核心作用，帮助开发者真正“懂得用”NestJS，提升后端开发的可维护性与灵活性。"
  },
  "状压dp——模板&分析&例题（存用）": {
    "title": "状压dp——模板&分析&例题（存用）",
    "summary": "状压DP是通过二进制位表示状态，将问题中的状态压缩为一个整数进行处理，常用位运算实现状态的转移与判断。文章通过例题说明了状压DP在路径规划中的应用，如A-Hie with the Pie使用Floyd求最短路并用二进制状态表示已访问城市，B-Travelling则用三进制状压表示每个城市最多访问两次的路径问题。"
  },
  "博弈论——模板&分析（存用）": {
    "title": "博弈论——模板&分析（存用）",
    "summary": "文章系统总结了经典博弈论模型：斐波那契博弈、巴什博弈、威佐夫博弈、尼姆博弈及SG函数理论，并介绍了Green Hackenbush树上删边游戏。核心结论表明，各类博弈的必败态可通过数学规律或SG函数判定，其中斐波那契博弈中总石子数为斐波那契数时先手必败，巴什博弈中当n%(m+1)==0时先手必败，尼姆博弈中异或和为0则先手必败，而SG函数可将任意公平组合游戏转化为等价的Nim博弈进行求解。"
  },
  "动态规划学习笔记（1）": {
    "title": "动态规划学习笔记（1）",
    "summary": "文章系统讲解了动态规划（动规）的基本思想与解题方法，从递归到动规的转化入手，介绍了动规的四个核心步骤：问题分解、状态确定、初始状态设定、状态转移方程，并强调了问题需具备最优子结构和无后效性两个特点。通过数字三角形、神奇的口袋、最长公共子序列、最长上升子序列等经典例题，详细说明了动规在不同场景下的建模与求解过程。"
  },
  "RMQ问题——线段树": {
    "title": "RMQ问题——线段树",
    "summary": "文章介绍了线段树在解决RMQ（区间最值查询）及区间修改问题中的应用，重点讲解了线段树的数组存储方式、节点编号关系（左子节点为2n，右子节点为2n+1），以及如何通过懒标记优化区间加、乘等操作。通过具体模板题（如区间加、区间加乘）说明了线段树在支持点修改和区间修改时的实现方法，强调了pushdown操作和“先乘后加”的关键逻辑。"
  },
  "RMQ问题——ST表算法": {
    "title": "RMQ问题——ST表算法",
    "summary": "ST表是一种用于解决区间最值查询的高效算法，通过O(nlogn)预处理实现O(1)查询，适用于静态数组的范围最大/最小值查询，但不支持在线修改。"
  },
  "note/front-end/bytedance-note/webpack-knowledge-system": {
    "title": "青训营 |「构建Webpack知识体系」",
    "summary": "本文系统讲解了前端工程化工具Webpack的核心概念、使用方法及原理，重点介绍了其打包流程、配置结构、Loader与插件机制，并通过实际案例演示了如何处理CSS、Less、Babel、HTML生成和HMR等常见场景。文章强调了Webpack在模块化、资源管理、代码优化（如Tree-Shaking）等方面的强大能力，帮助开发者理解前端工程化的实现路径与最佳实践。"
  },
  "note/front-end/bytedance-note/webgl-basics": {
    "title": "青训营 |「WebGL基础」",
    "summary": "本文详细介绍了WebGL的核心原理与工作流程，解释了为何WebGL复杂且需要深入理解GPU渲染管线，包括顶点着色器与片元着色器的执行过程、帧缓存机制以及坐标系差异。同时对比了Canvas 2D等其他图形技术，介绍了WebGL在图形处理中的优势与应用场景，并推荐了多个实用的WebGL相关库和学习资源。"
  },
  "note/front-end/bytedance-note/web-standards-and-front-end-development": {
    "title": "青训营 |「Web 标准与前端开发」",
    "summary": "文章系统梳理了前端开发的起源、发展历程与核心架构，从早期静态网页到如今的动态交互、模块化组件化时代，介绍了React、Vue、Webpack等主流技术与工具，并阐述了前端在企业、客户和开发者三大领域的应用。同时，文章深入讲解了浏览器、网络协议、Web标准（W3C、Ecma、WHATWG、IETF）的制定流程与参与方式，强调了掌握Web标准和理解浏览器技术对前端工程师的重要性。"
  },
  "note/front-end/bytedance-note/web-safe-getting-started": {
    "title": "青训营 |「Web开发的安全之旅」",
    "summary": "本文系统讲解了Web安全中的常见攻击类型及防御措施，重点介绍了跨站脚本攻击（XSS）的四种形式（存储型、反射型、DOM型、突变型）、跨站请求伪造（CSRF）以及SQL注入、DOS攻击等安全问题，并从开发者角度提供了全面的防护策略，如输入过滤、同源策略（CSP）、SameSite Cookie、预编译语句、HTTPS加密等，强调安全无小事，需持续学习和代码审查。"
  },
  "note/front-end/bytedance-note/web-multimedia-introduction": {
    "title": "青训营 |「Web多媒体入门」笔记",
    "summary": "文章系统介绍了Web多媒体技术的发展历程与核心概念，从PC时代的Flash插件到移动时代的HTML5与Media Source Extensions（MSE）的演进，重点讲解了图像与视频的基本参数（分辨率、深度、帧率、码率）、帧类型（I/P/B帧）、时间与解码时间戳、视频编码中的冗余去除机制，以及封装格式和流媒体协议（如HLS）的应用场景。通过MSE技术实现了无插件、支持多种格式的流媒体播放，并支持分段加载、清晰度切换和自适应码率等高级功能。"
  },
  "note/front-end/bytedance-note/typescript-introduction": {
    "title": "青训营 |「TypeScript入门」笔记",
    "summary": "本文介绍了TypeScript的发展历程、核心语法与优势，强调其作为JavaScript超集在静态类型检查、提升代码可读性与可维护性方面的价值。重点讲解了基本类型、高级类型（如联合、交叉、泛型、映射类型）、类型保护与类型守卫，并结合工程实践说明了TypeScript在Web和Node项目中的应用方式。"
  },
  "note/front-end/bytedance-note/responsive-system-and-react": {
    "title": "青训营 |「响应式系统与 React」",
    "summary": "文章系统介绍了React的历史背景、核心设计思想与应用场景，重点阐述了其组件化、单向数据流、虚拟DOM和Hook机制，并分析了React在前端、移动端及桌面端的广泛应用。通过虚拟DOM实现高效UI更新，结合响应式编程和状态管理库（如Redux、MobX）解决状态共享与复杂依赖问题，同时对比了React与Vue在函数式编程和模板语法上的差异，强调了组件组合优于继承的设计理念。"
  },
  "note/front-end/bytedance-note/nodejs-develop": {
    "title": "青训营 |「Node.js 与前端开发实战」",
    "summary": "本文系统介绍了 Node.js 的应用场景、运行时结构、核心特性及实战开发流程，重点讲解了其在前端工程化、HTTP 服务器搭建、服务端渲染（SSR）中的应用，并通过异步编程、回调优化、性能分析等实践展示了其开发优势与局限。文章还探讨了 Node.js 的跨平台特性、性能瓶颈、部署方案以及与底层技术（如 V8、N-API、WASM）的深度结合，强调其在开发效率、工具链成熟度和跨端应用中的独特价值。"
  },
  "note/front-end/bytedance-note/mini-program-develop": {
    "title": "青训营 |「小程序技术全解」笔记",
    "summary": "文章介绍了小程序的发展历程、业务价值与技术原理，重点讲解了其在渠道导流、业务试错和数字升级方面的三大价值，并通过实现一个简易番茄钟小程序，演示了小程序的开发流程与语法结构。同时对比了小程序与Web的差异，分析了其基于WebView+JSBridge的运行机制及运行时方案的优劣。"
  },
  "note/front-end/bytedance-note/mini-game-development": {
    "title": "青训营 |「小游戏开发」笔记",
    "summary": "文章介绍了前端视角下的游戏开发，强调前端与游戏开发并非对立，而是可以通过Web技术实现。重点介绍了适合前端开发的2D游戏引擎（如Cocos、Laya、Egret、PixiJS、Phaser等），讲解了其功能、优势与适用场景，并以Cocos Creator和PixiJS为例，说明了游戏开发的基本流程与技术实现路径。"
  },
  "note/front-end/bytedance-note/javascript-learing": {
    "title": "青训营 |「跟着月影学 JavaScript」笔记",
    "summary": "这节课系统讲解了 JavaScript 面向对象设计与组件封装的核心原则，通过深色模式切换和电商轮播图案例，展示了“各司其责”和“零 JS 实现展示逻辑”的最佳实践。重点介绍了高阶函数（如节流、防抖、批处理、可迭代化）的实现与过程抽象思想，强调通过函数式编程提升代码的可复用性、可测试性和可维护性。"
  },
  "note/front-end/bytedance-note/http-utilization-guide": {
    "title": "青训营 |「HTTP实用指南」",
    "summary": "文章系统介绍了HTTP协议的基本原理、请求响应机制、状态码、缓存策略（强缓存与协商缓存）、HTTP/2与HTTPS特性，并结合实际场景如静态资源加载、跨域问题（CORS）、单点登录（SSO）和登录流程进行分析。同时对比了RESTful API设计思想、常见请求头与响应头，以及WebSocket和QUIC等现代通信技术，最后总结了HTTP在实际应用中的优化策略与演进方向。"
  },
  "back-end/go_learning_3": {
    "title": "Go语言初上手（三）编码规范与性能优化 | 青训营",
    "summary": "本文系统介绍了编写高质量 Go 代码的关键实践，涵盖编码规范、注释与命名原则、控制流程优化、错误处理机制以及性能优化手段。通过使用 gofmt、goimports 等工具和清晰的命名规范，提升代码的可读性与可维护性；强调错误处理应以 error 为主、panic 为例外，并合理使用 Wrap/Unwrap 和 recover；在性能方面推荐预分配内存、使用 strings.Builder 拼接字符串、利用空结构体节省空间等技巧，最终实现正确、可靠、简洁且高效的 Go 程序。"
  },
  "back-end/go_learning_2": {
    "title": "Go语言初上手（二） 工程实践 | 青训营",
    "summary": "文章系统介绍了Go语言中的并发编程、依赖管理及测试机制。核心内容包括：通过协程实现轻量级并发，利用Channel进行通信共享内存，支持多核并行执行；依赖管理从GOPATH演进到Go Module，通过go.mod实现版本控制和多版本兼容；依赖分发通过GOPROXY代理提升稳定性和可用性；测试方面强调单元测试的重要性，采用_mock机制保证稳定性和幂等性，并引入基准测试分析性能瓶颈。"
  },
  "back-end/go_learning_1": {
    "title": "Go语言初上手(一) 环境配置与基础语法 | 青训营",
    "summary": "文章系统介绍了Go语言的基础语法和核心特性，涵盖数据类型（整型、浮点型、复数、布尔型、字符串）、变量声明与类型推导、指针操作、控制结构（for循环、if-else、switch）以及常用内置函数和标准库。内容结合《Go语言圣经》和青训营课程，强调了Go语言在性能、并发、简洁性与安全性的平衡，适合初学者快速掌握Go语言基础。"
  },
  "note/front-end/bytedance-note/development-and-debugging": {
    "title": "青训营 |「前端必须知道的开发调试知识」",
    "summary": "文章系统总结了前端调试的多平台、多环境特点，并详细介绍了 Chrome DevTools 的核心功能，如元素检查、控制台输出、源码调试、性能分析、网络请求监控等。重点讲解了如何通过 Source Map 调试压缩代码、移动端（iOS/Android）真机与模拟器调试、代理工具实现跨域和抓包，以及实用技巧如线上修改代码、小黄鸭调试法等，强调了前端调试在开发流程中的重要性。"
  },
  "note/front-end/bytedance-note/design-pattern": {
    "title": "青训营 |「前端设计模式应用」笔记",
    "summary": "文章介绍了JavaScript中常用的设计模式，包括单例模式、观察者模式（发布订阅）、原型模式、代理模式和迭代器模式，并结合浏览器和前端框架（如React、Vue）的实际应用场景进行说明。强调设计模式并非万能解决方案，其真正价值在于通过实际项目学习和实践，理解如何在复杂系统中实现对象创建、结构组织和行为通信的高效解耦。"
  },
  "note/front-end/bytedance-note/css-learning-layout": {
    "title": "青训营 |「CSS布局」",
    "summary": "文章系统介绍了CSS盒模型的组成与属性，包括内容区、内边距、边框和外边距的定义与计算方式，重点讲解了box-sizing、overflow、display、浮动、Flex布局和Grid布局等核心概念，详细说明了各布局方式中元素的排列、对齐、伸缩及响应式行为，帮助理解网页中元素的布局机制与渲染逻辑。"
  },
  "note/front-end/bytedance-note/animation-implement": {
    "title": "青训营 |「前端动画实现」",
    "summary": "文章系统讲解了动画的基本原理、发展史及前端实现技术，重点介绍了CSS动画、SVG动画和JS动画的实现方式与特点。通过解析CSS动画的属性（如@keyframes、transform、transition）和动画机制（帧率、补间、帧率与视觉暂留），以及SVG通过SMIL、JS或CSS实现的动画效果，文章阐述了不同技术在UI设计、数据可视化等场景中的适用性与局限性。"
  },
  "coding-train/leetcode/offer/day9": {
    "title": "剑指offer day9 动态规划（中等）",
    "summary": "文章介绍了两道剑指 Offer 题目：一道是求连续子数组最大和（使用动态规划，时间复杂度 O(n)），另一道是求网格中从左上到右下路径的最大礼物价值（使用二维动态规划，状态转移为取上方或左方最大值）。两题均考察数组和动态规划思维，是经典算法题。"
  },
  "coding-train/leetcode/offer/day8": {
    "title": "剑指offer day8 动态规划（简单）",
    "summary": "文章总结了三道剑指 Offer 题目：斐波那契数列和青蛙跳台阶问题本质上都是斐波那契数列的变种，通过动态规划或迭代优化求解，注意取模；股票最大利润问题通过遍历数组记录最小值并计算最大差值，实现一次买卖的最大收益。三题均考察数组和动态规划思维，难度由简单到中等。"
  },
  "coding-train/leetcode/offer/day7": {
    "title": "剑指offer day7 搜索与回溯算法（简单）",
    "summary": "文章介绍了三道二叉树相关的剑指 Offer 题目：判断一棵树是否包含另一棵树作为其子结构、实现二叉树的镜像翻转、以及判断二叉树是否对称。三题均涉及二叉树的递归遍历，难度分别为中等、简单、简单，核心思想是通过深度优先搜索（DFS）或递归方式完成结构比对与镜像操作。"
  },
  "coding-train/leetcode/offer/day6": {
    "title": "剑指offer day6 搜索与回溯算法（简单）",
    "summary": "文章介绍了三道剑指 Offer 关于二叉树的层次遍历题目：第一题要求从上到下按层打印二叉树（使用 BFS）；第二题在第一题基础上，每层结果单独成行；第三题要求按之字形顺序打印，即奇数层从左到右、偶数层从右到左，通过判断层高来控制输出方向。三题均基于 BFS 思想，考察二叉树的层序遍历与方向控制。"
  },
  "coding-train/leetcode/offer/day5": {
    "title": "剑指offer day5 查找算法（中等）",
    "summary": "文章总结了三道剑指 Offer 题目：通过从右上角出发在二维有序数组中查找目标值，利用“向右下或左上”移动的特性实现高效搜索；通过二分查找或分段比较，解决旋转数组中找到最小值的问题，特别处理了重复元素的情况；利用哈希表统计字符频次，找出字符串中第一个只出现一次的字符。"
  },
  "coding-train/leetcode/offer/day4": {
    "title": "剑指offer day4 查找算法（简单）",
    "summary": "文章总结了三道剑指Offer的简单题：通过排序或哈希查找数组中重复的数字；在排序数组中查找目标数字的出现次数；以及在0～n-1范围内找出缺失的数字。三题均考察数组操作与逻辑思维，难度较低，分别涉及排序、哈希表和下标与值的对比。"
  },
  "coding-train/leetcode/offer/day31": {
    "title": "剑指offer day31 数学（困难）",
    "summary": "文章总结了三道剑指 Offer 数学题：  \n1. 剪绳子 II 通过贪心策略将绳子剪成尽可能多的 3 段，剩余部分为 2 或 4，求最大乘积并取模；  \n2. 1～n 整数中 1 出现的次数，按数位分别计算每段 10^k 位上 1 的出现次数，通过循环和余数分段求解；  \n3. 数字序列中某一位的数字，通过统计连续数字的位数，确定目标位属于哪个数字，再定位具体数字和位数。"
  },
  "coding-train/leetcode/offer/day30": {
    "title": "剑指offer day30 分治算法（困难）",
    "summary": "文章介绍了两道剑指Offer题目：第一题“打印从1到最大的n位数”通过模拟递增输出n位数，注意避免大数问题；第二题“数组中的逆序对”利用归并排序的思想，在合并过程中统计逆序对数量，时间复杂度为O(n log n)。"
  },
  "coding-train/leetcode/offer/day3": {
    "title": "剑指offer day3 字符串（简单）",
    "summary": "文章介绍了两道剑指Offer的简单字符串题目：一是将字符串中的空格替换为\"%20\"，可使用正则或遍历实现；二是实现字符串左旋转操作，将前k个字符移到末尾，可通过字符串拼接或双指针完成。两题均考察字符串基本操作，逻辑清晰，适合初学者掌握。"
  },
  "coding-train/leetcode/offer/day29": {
    "title": "剑指offer day29 动态规划（困难）",
    "summary": "文章总结了三道剑指Offer的中等至困难题目：正则表达式匹配通过动态规划处理字符和通配符匹配；丑数问题通过维护三个指针模拟乘以2、3、5的倍数生成有序丑数序列；n个骰子点数概率问题利用动态规划计算所有可能点数和的概率分布，并优化空间复杂度。"
  },
  "coding-train/leetcode/offer/day28": {
    "title": "剑指offer day28 搜索与回溯算法（困难）",
    "summary": "文章介绍了两道剑指Offer题目：一道是二叉树的序列化与反序列化，通过先序遍历将树转换为字符串，空节点用\"N\"表示；另一道是字符串的全排列，需处理重复字符，使用回溯法并借助哈希表去重，确保结果不包含重复排列。"
  },
  "coding-train/leetcode/offer/day27": {
    "title": "剑指offer day27 栈与队列（困难）",
    "summary": "文章介绍了两道剑指 Offer 题目：第一题是滑动窗口的最大值，使用单调队列维护窗口内元素的下标，保证队列中元素值单调递减，实现滑动窗口最大值的高效查询；第二题是设计一个支持O(1)时间复杂度的队列，能够实现push_back、pop_front和max_value操作，通过在队列中维护一个单调递减的辅助队列来快速获取最大值。"
  },
  "coding-train/leetcode/offer/day26": {
    "title": "剑指offer day26 字符串（中等）",
    "summary": "文章介绍了两道剑指 Offer 题目：一道判断字符串是否表示数值（支持整数、小数及科学计数法），另一道将字符串转换为整数并处理边界情况。两题均通过模拟方式实现，核心思路是逐字符遍历、处理符号、数字、小数点、e/E等特殊情况，并注意空格、边界和整数范围限制。"
  },
  "coding-train/leetcode/offer/day25": {
    "title": "剑指offer day25 模拟（中等）",
    "summary": "文章介绍了两道剑指 Offer 题目：一道是顺时针打印矩阵（模拟螺旋遍历），另一道是判断栈的弹出序列是否合法（使用模拟栈的方法验证）。两题均考察数组和栈的基本操作，难度分别为简单和中等。"
  },
  "coding-train/leetcode/offer/day24": {
    "title": "剑指offer day24 数学（中等）",
    "summary": "文章总结了三道剑指Offer题目：通过数学分析得出“剪绳子”最大乘积应尽量切成3段，余数为2时保留，为1时合并为2+2；使用双指针法求解“和为s的连续正数序列”；利用约瑟夫环思想解决“圆圈中最后剩下的数字”问题，通过递推公式求解剩余数字。"
  },
  "coding-train/leetcode/offer/day23": {
    "title": "剑指offer day23 数学（简单）",
    "summary": "文章介绍了两道剑指 Offer 题目：39 题通过“摩尔投票法”在 O(1) 空间内找出出现次数超过一半的数字，66 题通过前缀和与后缀积的思想，构建乘积数组，避免使用除法。"
  },
  "coding-train/leetcode/offer/day22": {
    "title": "剑指offer day22 位运算（中等）",
    "summary": "文章介绍了两道剑指 Offer 题目：第一题在数组中找出两个只出现一次的数字，利用异或和位运算通过掩码分组求解；第二题在数组中找出只出现一次的数字，其他数字出现三次，通过统计每一位的出现次数模3得到结果。两题均在时间O(n)和空间O(1)的约束下解决。"
  },
  "coding-train/leetcode/offer/day21": {
    "title": "剑指offer day21 位运算（简单）",
    "summary": "文章介绍了两道剑指 Offer 题目：第一题通过位运算 `x & (x-1)` 快速统计无符号整数二进制中 1 的个数；第二题通过异或实现无进位相加，进位通过按位与左移实现，循环处理直到进位消失，从而在不使用加减乘除运算的情况下实现两数相加。"
  },
  "coding-train/leetcode/offer/day20": {
    "title": "剑指offer day20 分治算法（中等）",
    "summary": "文章总结了三道剑指 Offer 题目：通过前序和中序遍历重建二叉树，利用分治法和递归实现；使用快速幂算法计算整数次方，注意 JavaScript 中移位运算的符号处理；判断数组是否为某二叉搜索树的后序遍历序列，通过验证后序遍历的单调性与分治性质来解决。"
  },
  "coding-train/leetcode/offer/day2": {
    "title": "剑指offer day2 链表（简单）",
    "summary": "文章总结了三道剑指 Offer 链表类题目：通过栈实现从尾到头打印链表，使用迭代法反转链表，以及利用哈希表或链表拆分法复制包含 random 指针的复杂链表。"
  },
  "coding-train/leetcode/offer/day19": {
    "title": "剑指offer day19 搜索与回溯算法（中等）",
    "summary": "文章介绍了三道剑指 Offer 题目：通过短路运算符实现无条件判断的求和问题（求1+2+...+n）；利用二叉搜索树性质高效找到两个节点的最近公共祖先；以及在一般二叉树中通过父节点关系遍历找到最近公共祖先。三题分别考察递归、树的性质和DFS思想，难度由中等递进至简单。"
  },
  "coding-train/leetcode/offer/day18": {
    "title": "剑指offer day18 搜索与回溯算法（中等）",
    "summary": "文章介绍了两道剑指 Offer 题目：一是求二叉树的深度，通过递归计算从根到叶的最长路径长度；二是判断二叉树是否为平衡二叉树，即任意节点的左右子树深度差不超过1，需递归检查每个节点的左右子树高度及整体平衡性。两题均使用深度优先搜索（DFS）思路解决，难度为简单。"
  },
  "coding-train/leetcode/offer/day17": {
    "title": "剑指offer day17 排序（中等）",
    "summary": "文章介绍了两道剑指Offer经典题目：一道是找出数组中最小的k个数，可通过排序切片或快排思想实现；另一道是设计数据流中的中位数数据结构，支持动态添加数字并实时返回中位数，常用方法是维护两个堆来高效维护中位数。"
  },
  "coding-train/leetcode/offer/day16": {
    "title": "剑指offer day16 排序（简单）",
    "summary": "文章总结了两道剑指 Offer 面试题：第45题要求将数组中的数字拼接成最小的数，通过自定义排序规则（a+b > b+a）实现；第61题判断5张扑克牌是否能组成顺子，通过排序后检查最大值-最小值<5且无重复数字（除0外）来判断。两题分别考察数组排序和逻辑判断能力，难度为中等和简单。"
  },
  "coding-train/leetcode/offer/day15": {
    "title": "剑指offer day15 搜索与回溯算法（中等）",
    "summary": "文章总结了三道剑指 Offer 题目：34题通过深度优先搜索（DFS）找出从根到叶子节点路径和等于目标值的所有路径；36题通过中序遍历将二叉搜索树转换为排序的循环双向链表，调整指针实现节点间前后关系；54题利用二叉搜索树的特性，通过右中左遍历找到第k大的节点。三题均涉及树的遍历，难度分别为中等、中等、简单。"
  },
  "coding-train/leetcode/offer/day14": {
    "title": "剑指offer day14 搜索与回溯算法（中等）",
    "summary": "文章介绍了两道剑指 Offer 中的中等难度题目：第一题“矩阵中的路径”通过回溯和深度优先搜索判断单词是否能按相邻格子顺序在二维矩阵中找到；第二题“机器人的运动范围”通过广度优先搜索计算机器人在满足数字位数和限制条件下能到达的格子数量。"
  },
  "coding-train/leetcode/offer/day13": {
    "title": "剑指offer day13 双指针（简单）",
    "summary": "文章总结了三道剑指 Offer 题目：通过双指针法在 O(1) 空间内调整数组使奇数在前、偶数在后；利用双指针在有序数组中查找和为 s 的两个数字；以及通过正则表达式或字符串操作实现单词顺序反转，处理空格和边界情况。三题均考察数组操作与双指针技巧，难度适中，重点突出算法效率与边界条件处理。"
  },
  "coding-train/leetcode/offer/day12": {
    "title": "剑指offer day12 双指针（简单）",
    "summary": "文章介绍了两道链表相关题目：一道是合并两个递增排序的链表，使用双指针法按值大小比较逐个连接节点，时间复杂度O(m+n)，空间复杂度O(1)；另一道是找两个链表的第一个公共节点，通过双指针技巧，将两个指针分别遍历两个链表，当一个指针到达尾部时转向另一个链表的头，最终两指针会在交点或同时为null时相遇，实现O(1)空间和O(m+n)时间的解法。"
  },
  "coding-train/leetcode/offer/day11": {
    "title": "剑指offer day11 双指针（简单）",
    "summary": "文章介绍了两道链表经典题目：通过双指针法找到链表中倒数第k个节点，以及根据节点值直接删除链表中的指定节点。两题均使用简单思路，分别涉及双指针和链表操作，适合初学者掌握链表基本操作。"
  },
  "coding-train/leetcode/offer/day10": {
    "title": "剑指offer day10  动态规划（中等）",
    "summary": "文章介绍了两道剑指 Offer 题目：46 题通过动态规划解决数字翻译成字符串的解码方法，状态转移类似斐波那契，考虑单个数字和两位数字的组合翻译；48 题使用滑动窗口法求最长不含重复字符的子串，通过哈希记录字符最后出现位置，高效判断重复字符。"
  },
  "coding-train/leetcode/offer/day1": {
    "title": "剑指offer day1 栈与队列（简单）",
    "summary": "文章介绍了如何使用两个栈模拟队列的入队和出队操作，以及如何设计一个栈，在支持push、pop和min操作的同时，保证每个操作的时间复杂度为O(1)。"
  },
  "PAT乙级刷题感想及踩坑总结": {
    "title": "PAT乙级刷题感想及踩坑总结",
    "summary": "这篇文章是PAT乙级考试的复习总结，重点梳理了常见题型和解题技巧，强调细节处理如格式控制、边界条件、数据类型选择和字符串处理。作者通过列举多道经典题目，指出PAT乙级注重基础算法（如排序、筛法、模拟）和细节把控，建议熟练掌握vector、map等STL工具，并重视输入输出格式和边界情况。"
  },
  "2021秋PAT乙级真题题解及赛后总结": {
    "title": "2021秋PAT乙级真题题解及赛后总结",
    "summary": "文章介绍了五道编程题的解题思路与实现，涵盖好数判断、数字分类、字符串变换验证、数组链表结构模拟以及帽子取用顺序问题。每道题均采用不同算法解决，从暴力枚举到模拟操作，体现了对数据结构和逻辑推理的综合应用。"
  },
  "2020蓝桥杯省模拟赛题目记录": {
    "title": "2020蓝桥杯省模拟赛题目记录",
    "summary": "文章总结了2020年蓝桥杯模拟省赛的题目及解题思路，涵盖填空题和9道编程题，涉及字符串处理、摆动序列计数、螺旋矩阵、圆面积最大覆盖、最小生成树等算法问题，部分题目使用了递归、记忆化、贪心或图论方法，整体反映了作者在竞赛中的实际水平和学习提升方向。"
  },
  "coding-train/leetcode/bytedance/bytedance-day9": {
    "title": "冲刺春招-精选笔面试66题大通关day9",
    "summary": "文章总结了三道题目：通过前序和中序遍历序列构造二叉树，使用层序遍历实现二叉树的锯齿形遍历，以及通过重排数组元素组成最大整数。前三题难度为中等，涉及树的构建与遍历，最后一题为字节跳动面试题，核心思想是通过自定义排序规则（字符串拼接比较）解决最大数问题。"
  },
  "coding-train/leetcode/bytedance/bytedance-day8": {
    "title": "冲刺春招-精选笔面试66题大通关day8",
    "summary": "文章总结了三道经典面试题：使用栈判断括号是否有效的匹配问题，通过DFS或并查集求解二维网格中的岛屿数量，以及利用滑动窗口法找出字符串s中包含t所有字符的最小子串。三题分别涉及栈、深度优先搜索和滑动窗口等核心算法思想，难度由简单到困难，覆盖了面试中常见的数据结构与算法应用场景。"
  },
  "coding-train/leetcode/bytedance/bytedance-day7": {
    "title": "冲刺春招-精选笔面试66题大通关day7",
    "summary": "文章总结了三道经典数组题目：53. 最大子数组和通过动态规划思想，维护当前连续子数组的最大和；152. 乘积最大子数组需考虑正负数对乘积的影响，使用两个变量分别记录最大和最小乘积；41. 缺失的第一个正数通过原地标记法，在O(n)时间和常数空间内找到最小缺失正整数。"
  },
  "coding-train/leetcode/bytedance/bytedance-day6": {
    "title": "冲刺春招-精选笔面试66题大通关day6",
    "summary": "文章介绍了三道编程题的解题思路与代码实现：  \n- 33. 搜索旋转排序数组：通过两次二分查找旋转分界点，判断目标值在左半段还是右半段，时间复杂度为 O(log n)；  \n- 54. 螺旋矩阵：模拟顺时针螺旋遍历，按右→下→左→上的顺序处理边界，时间复杂度 O(mn)；  \n- bytedance-006. 夏季特惠：转化为01背包问题，关键在于将每个游戏的优惠金额作为“收益”，在预算约束下最大化快乐值，注意处理优惠与超支的关系。"
  },
  "coding-train/leetcode/bytedance/bytedance-day5": {
    "title": "冲刺春招-精选笔面试66题大通关day5",
    "summary": "文章总结了三道中等至困难的面试题：通过数学方法和溢出判断实现整数反转；使用快排或排序找出数组中第k个最大元素；利用暴力合并或优先队列将K个升序链表合并为一个升序链表。"
  },
  "coding-train/leetcode/bytedance/bytedance-day4": {
    "title": "冲刺春招-精选笔面试66题大通关day4",
    "summary": "文章总结了三道经典算法题：两数之和（使用哈希表，简单）、三数之和（排序+双指针，中等）、接雨水（单调栈，困难），涵盖了数组操作、双指针和单调栈等核心技巧，适用于春招笔试面试的算法训练。"
  },
  "coding-train/leetcode/bytedance/bytedance-day3": {
    "title": "冲刺春招-精选笔面试66题大通关day3",
    "summary": "文章介绍了三道面试题的解题思路与代码实现：206. 反转链表通过遍历链表节点实现反转；199. 二叉树的右视图使用层序遍历（BFS）从右向左收集每层最右侧节点；bytedance-016. 最短移动距离在树结构上通过模拟松鼠移动和房间分配，利用自底向上的路径策略求解最小总移动距离，题目难度被字节定义为“重新定义简单”。"
  },
  "coding-train/leetcode/bytedance/bytedance-day22": {
    "title": "冲刺春招-精选笔面试66题大通关day22",
    "summary": "文章总结了三天编程题的解题思路与核心知识点：151题通过双指针和数组操作实现字符串中单词的逆序排列，处理空格问题；46题使用回溯法生成数组的全排列；2题模拟大数相加，利用链表结构实现两个逆序存储整数的相加。三题涵盖字符串、递归和链表，难度中等，重点考察空间优化与逻辑处理能力。"
  },
  "coding-train/leetcode/bytedance/bytedance-day21": {
    "title": "冲刺春招-精选笔面试66题大通关day21",
    "summary": "文章总结了每日三道编程题：69. x的平方根通过二分查找求整数平方根；912. 排序数组使用归并排序实现升序排列；887. 鸡蛋掉落通过逆向思维和动态规划，求解在给定鸡蛋和楼层数下确定临界楼层的最小操作次数。"
  },
  "coding-train/leetcode/bytedance/bytedance-day20": {
    "title": "冲刺春招-精选笔面试66题大通关day20",
    "summary": "文章介绍了三道题目：704. 二分查找（简单，求有序数组中目标值的下标）、43. 字符串相乘（中等，模拟竖式乘法实现大数相乘）、以及字节跳动面试题 bytedance-002（简单，求最少时间完成所有工区的下午茶配送）。核心思路分别为直接二分查找、模拟乘法过程和二分答案结合贪心思想求解配送时间。"
  },
  "coding-train/leetcode/bytedance/bytedance-day2": {
    "title": "冲刺春招-精选笔面试66题大通关day2",
    "summary": "文章总结了三道经典算法题：14. 最长公共前缀通过逐字符比对找出字符串数组的公共前缀；3. 无重复字符的最长子串使用滑动窗口和哈希表记录字符出现情况，求解最长不重复子串长度；124. 二叉树中的最大路径和通过递归遍历，对每个节点计算左右子树最大路径和，动态更新全局最大路径和。"
  },
  "coding-train/leetcode/bytedance/bytedance-day19": {
    "title": "冲刺春招-精选笔面试66题大通关day19",
    "summary": "文章总结了三道链表相关题目：通过双指针法求解两个链表的相交节点，利用递归与双端操作重排链表，以及使用快慢指针找到环形链表的入环节点。三题分别涉及链表的交点判断、节点重排和环的检测，均体现了双指针、递归和空间优化等核心解题思路。"
  },
  "coding-train/leetcode/bytedance/bytedance-day18": {
    "title": "冲刺春招-精选笔面试66题大通关18",
    "summary": "文章介绍了三道题目：322. 零钱兑换（动态规划求最少硬币数）、198. 打家劫舍（动态规划求最大偷窃金额）和 bytedance-003. 古生物血缘远近判定（求两个DNA序列的最小编辑距离）。三题均涉及动态规划，分别解决硬币组合、房屋偷窃和DNA序列差异问题，核心思想是通过状态转移求解最优解。"
  },
  "coding-train/leetcode/bytedance/bytedance-day17": {
    "title": "冲刺春招-精选笔面试66题大通关17",
    "summary": "文章总结了三天编程题的学习内容：通过快慢指针判断链表中是否有环，利用DFS遍历找到二叉树中两个节点的最近公共祖先，以及通过分段反转链表实现指定区间链表的反转。三题分别涉及链表、二叉树和链表操作，重点掌握了快慢指针、DFS遍历和链表反转的实现方法。"
  },
  "coding-train/leetcode/bytedance/bytedance-day16": {
    "title": "冲刺春招-精选笔面试66题大通关16",
    "summary": "文章总结了每日三道编程题的解题思路与代码实现：通过正则和递归展开化学公式中的元素个数；使用DFS计算二叉树中所有根节点到叶节点表示的数字之和；利用单调队列求解滑动窗口中的最大值。题目涵盖正则表达式、树的深度优先搜索和滑动窗口等核心算法，难度从简单到困难，适合春招笔试练习。"
  },
  "coding-train/leetcode/bytedance/bytedance-day15": {
    "title": "冲刺春招-精选笔面试66题大通关day15",
    "summary": "文章介绍了三道面试常见题目的解题思路与实现：  \n用两个栈模拟队列实现先入先出操作，通过栈的特性实现队列的push、pop、peek和empty功能；  \n使用回溯法生成所有有效的n对括号组合，通过递归枚举左括号和右括号的排列；  \n利用哈希表记录数字存在性，遍历数组并以每个数为起点判断连续序列长度，实现O(n)时间复杂度的最长连续序列查找。"
  },
  "coding-train/leetcode/bytedance/bytedance-day14": {
    "title": "冲刺春招-精选笔面试66题大通关day14",
    "summary": "文章总结了三道经典算法题：121. 买卖股票的最佳时机通过遍历数组记录最小值和最大利润求解；56. 合并区间通过排序后按左端点合并重叠区间；135. 分发糖果通过左右两次遍历，确保每个孩子获得比相邻更高评分者更多的糖果，最终得到最少糖果总数。"
  },
  "coding-train/leetcode/bytedance/bytedance-day13": {
    "title": "冲刺春招-精选笔面试66题大通关day13",
    "summary": "文章总结了三道经典算法题：88. 合并两个有序数组使用双指针在 O(m+n) 时间内完成合并；31. 下一个排列通过找到“第一个升序对”和“最右的更大元素”进行交换并反转后半部分，实现原地求下一个字典序排列；4. 寻找两个有序数组的中位数采用二分查找思想，通过分治法在 O(log(m+n)) 时间内求解中位数。"
  },
  "coding-train/leetcode/bytedance/bytedance-day12": {
    "title": "冲刺春招-精选笔面试66题大通关day12",
    "summary": "文章总结了三道中等难度的动态规划与数学问题：64. 最小路径和通过DP求网格中从左上到右下的最小路径和；300. 最长递增子序列用动态规划求解最长递增子序列长度，并可优化到O(n log n)；bytedance-004. 机器人跳跃问题通过逆推方程求解初始最小能量，确保能量不为负。"
  },
  "coding-train/leetcode/bytedance/bytedance-day11": {
    "title": "冲刺春招-精选笔面试66题大通关day11",
    "summary": "文章总结了三天编程题的学习内容：415. 字符串相加通过模拟大数相加过程，从右往左处理进位；5. 最长回文子串使用动态规划，判断子串是否为回文；72. 编辑距离通过三维状态转移，求解两个单词之间最少编辑操作数。三题分别涉及字符串模拟、动态规划和经典DP问题，涵盖简单到困难难度。"
  },
  "coding-train/leetcode/bytedance/bytedance-day10": {
    "title": "冲刺春招-精选笔面试66题大通关day10",
    "summary": "文章介绍了三道编程题的解题思路与代码实现：94. 二叉树的中序遍历通过“左-根-右”顺序完成；102. 二叉树的层序遍历使用队列逐层从左到右遍历节点；394. 字符串解码利用栈处理嵌套方括号，按重复次数解码字符串。三题分别涉及树的遍历、层序遍历和字符串处理，难度为简单到中等。"
  },
  "coding-train/leetcode/bytedance/bytedance-day1": {
    "title": "冲刺春招-精选笔面试66题大通关day1",
    "summary": "文章总结了三天链表相关题目的学习与解题思路：通过递归实现两个有序链表的合并，使用双向链表模拟LRU缓存机制以实现O(1)时间复杂度的get和put操作，以及通过分段反转实现K个节点一组翻转链表，并注意边界条件和指针正确性。"
  },
  "js-learning-2": {
    "title": "深入JavaScript学习之路（二）JavaScript中的类",
    "summary": "文章介绍了 ES6 中类（class）的语法特性与底层机制，指出类是基于原型和构造函数的语法糖，具有构造函数、实例方法、静态方法及访问器等成员，并支持单继承、extends 关键字和 super 调用。通过 new.target 和构造函数检查可实现抽象基类，同时支持继承内置类型和类混入，但强调“组合胜过继承”，建议避免多继承模拟。"
  },
  "js-learning-1": {
    "title": "深入JavaScript学习之路（一）对象、类与面向对象编程",
    "summary": "文章系统讲解了 JavaScript 中对象的定义、属性类型（数据属性与访问器属性）、属性特性（如可枚举、可配置、可写等）、对象创建方式（构造函数、原型模式、工厂模式）、原型链机制及继承关系，深入分析了 new 操作符的执行过程，并介绍了 ES6 中的对象语法糖（属性简写、可计算属性、解构赋值等）。同时对比了不同对象创建模式的优劣，强调了原型继承的共享机制和最佳实践，为理解 JavaScript 对象模型和面向对象编程奠定了基础。"
  },
  "optimizing-javascript-translate": {
    "title": "优化 JavaScript 的乐趣和好处【译文】",
    "summary": "本文系统总结了 JavaScript 性能优化的八大核心技巧，强调优化必须以基准测试为前提，避免盲目优化。内容涵盖避免不必要的工作（如记忆化、延迟计算）、减少对象形状变化（保持对象结构一致）、避免数组/对象方法的冗余复制、减少间接访问、优化缓存命中率、控制大对象使用、合理使用 eval 以及高效处理字符串操作。作者指出，性能优化需在可读性与效率之间权衡，且许多优化效果在实际运行中可能被忽略，因此必须结合具体场景和基准测试来验证。"
  },
  "onclick-and-addeventlistener-difference": {
    "title": "前端面试之onclick与addEventListener区别详述",
    "summary": "onclick 是 HTML 元素上的旧式事件绑定方式，会覆盖原有事件、无法添加多个监听器、不支持捕获/冒泡控制、兼容性好但灵活性差；而 addEventListener 是 W3C 标准方法，支持多个监听器、捕获与冒泡阶段控制、可动态移除、兼容性稍弱但功能更强大且更符合现代开发实践。"
  },
  "redux-learning-1": {
    "title": "Redux学习之路（一）Redux三原则、createSore原理及实现",
    "summary": "本文系统介绍了 Redux 的核心概念与实现原理，包括单一不可变状态树、状态只读、通过 Action 触发状态变化以及使用纯函数（Reducer）描述状态变更三大原则。文章通过实现一个简易计数器和 Todo 应用示例，详细讲解了 createStore 的核心逻辑及 getState、dispatch、subscribe 等方法的运作机制，并强调 Redux 适用于复杂状态管理场景，但需根据实际需求权衡使用。"
  },
  "react-learning-1": {
    "title": "React学习小记",
    "summary": "文章介绍了 React 中事件处理、列表 key 的使用、表单（特别是受控组件）以及状态提升的核心概念。强调事件处理应使用函数而非字符串，通过 preventDefault 阻止默认行为；key 用于标识列表元素，确保在兄弟节点间唯一；表单通过受控组件由 React 状态管理，实现数据流的自上而下控制；状态提升是管理共享状态的最佳实践，能简化调试并提升代码可维护性。"
  }
}
